# Даны 2 действительных числа а и b. Получите их сумму, разность и произведение

a = 7
b = 6

print("Сумма =", a + b, "Разность =", a - b, "Произведение =", a * b)