# Даны действительные числа х и у. Получить (x - y) / (1 + xy)

x = 10
y = 15

print((x - y) / (1 + x*y))
