# Даны действительные числа x и y. Получить |x| − |y|/ 1+ |xy|
x, y = 65, 23
print("Результат уравнения:", round((x - y) / (1 + (x * y)), 3))
