# Дана длина ребра куба. Найти объем куба и площадь его боковой поверхности.
edge_length_cube = 7
print("Объем куба =", edge_length_cube**3)
print("Площадь боковой поверхности = ", 4 * edge_length_cube ** 2)
