#Даны 2 действительных числа a и b. Получить их сумму, разность и произведение
a, b = 15, 6
print("Сумма чисел:", a + b)
print("Разность чисел:", a - b)
print("Произведение чисел:", a * b)
