# Даны два действительных числа
x = -5
y = 80
# Используется функция abs для вычисления в Python модуля числа
module_x = abs(x)
module_y = abs(y)

solution = (module_x - module_y) / (1 + module_x * module_y)
print(solution)
