# Даны два действительных числа
a = 5
b = 10
# Найти сумму, разность, произведение
sum = a + b
subt = a - b
mult = a * b
print(sum)
print(subt)
print(mult)

