# Даны два действительных числа
a = 7
b = 21
# Найти среднее арифмитеское чисел
average = (a+b)/2
# Найти среднее геометрическое чисел
geometric_mean = (a*b)**0.5

print(average)
print(geometric_mean)