# Дана длина ребра куба
cube_edge = 8
# Найти объем куба
volume_cube = cube_edge ** 3
# Найти площадь боковой поверности куба
cube_lateral_surface = cube_edge ** 2

print(volume_cube)
print(cube_lateral_surface)
