# Дан список: [‘Ivan’, ‘Ivanou’], и 2 строки: Minsk, Belarus
# Напечатайте текст: “Привет, Ivan Ivanou! Добро пожаловать в Minsk Belarus”


spis_name = ["Ivan", "Ivanou"]
city = "Minsk"
country = "Belarus"
print(f"“Привет, {spis_name[0]} {spis_name[1]}! Добро пожаловать в {city} {country}”")
