# Создайте список из 10 элементов, вставьте на 3-ю позицию новое значение,
# удалите элемент из списка под индексом 6

spis_10 = [5,4,17,13,4,16,7,1,2,22]
spis_10.insert(2,100)
del spis_10[6]
print(spis_10)
